# Указываем базовый образ Go для сборки
FROM golang:1.23.1-alpine AS builder

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod download

# Копируем исходный код приложения в контейнер
COPY . .

# Собираем бинарный файл приложения
RUN go build -o main .

# Используем минимальный образ для запуска готового бинарного файла
FROM alpine:latest

# Устанавливаем рабочую директорию для финального контейнера
WORKDIR /root/

# Копируем скомпилированное приложение из предыдущего контейнера
COPY --from=builder /app/main .

# Указываем, какой порт будет прослушивать приложение
EXPOSE 8080

# Запускаем приложение
CMD ["./main"]
